## Generated SDC file "DE2_CCD.out.sdc"

## Copyright (C) 1991-2015 Altera Corporation. All rights reserved.
## Your use of Altera Corporation's design tools, logic functions 
## and other software and tools, and its AMPP partner logic 
## functions, and any output files from any of the foregoing 
## (including device programming or simulation files), and any 
## associated documentation or information are expressly subject 
## to the terms and conditions of the Altera Program License 
## Subscription Agreement, the Altera Quartus II License Agreement,
## the Altera MegaCore Function License Agreement, or other 
## applicable license agreement, including, without limitation, 
## that your use is for the sole purpose of programming logic 
## devices manufactured by Altera and sold by Altera or its 
## authorized distributors.  Please refer to the applicable 
## agreement for further details.


## VENDOR  "Altera"
## PROGRAM "Quartus II"
## VERSION "Version 15.0.0 Build 145 04/22/2015 SJ Full Version"

## DATE    "Tue Nov 22 12:07:02 2016"

##
## DEVICE  "EP4CE115F29C7"
##


#**************************************************************
# Time Information
#**************************************************************

set_time_format -unit ns -decimal_places 3



#**************************************************************
# Create Clock
#**************************************************************

create_clock -name {clk} -period 20.000 -waveform { 0.000 10.000 } [get_ports {CLOCK_50}]


#**************************************************************
# Create Generated Clock
#**************************************************************

create_generated_clock -name {u6|sdram_pll1|altpll_component|pll|clk[0]} -source [get_pins {u6|sdram_pll1|altpll_component|pll|inclk[0]}] -duty_cycle 50.000 -multiply_by 2 -master_clock {clk} [get_pins {u6|sdram_pll1|altpll_component|pll|clk[0]}] 
create_generated_clock -name {u6|sdram_pll1|altpll_component|pll|clk[1]} -source [get_pins {u6|sdram_pll1|altpll_component|pll|inclk[0]}] -duty_cycle 50.000 -multiply_by 2 -phase -108.000 -master_clock {clk} [get_pins {u6|sdram_pll1|altpll_component|pll|clk[1]}] 


#**************************************************************
# Set Clock Latency
#**************************************************************



#**************************************************************
# Set Clock Uncertainty
#**************************************************************



#**************************************************************
# Set Input Delay
#**************************************************************

set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {AUD_ADCDAT}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {AUD_ADCDAT}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {AUD_ADCLRCK}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {AUD_ADCLRCK}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {AUD_BCLK}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {AUD_BCLK}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {AUD_DACLRCK}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {AUD_DACLRCK}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {CLOCK_50}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {CLOCK_50}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[8]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[8]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[9]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[9]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[10]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[10]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[11]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[11]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[12]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[12]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[13]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[13]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[14]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[14]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[15]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[15]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[8]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[8]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[9]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[9]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[10]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[10]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[11]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[11]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[12]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[12]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[13]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[13]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[14]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[14]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[15]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[15]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_INT}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_INT}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[8]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[8]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[9]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[9]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[10]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[10]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[11]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[11]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[12]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[12]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[13]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[13]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[14]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[14]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[15]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[15]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[16]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[16]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[17]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[17]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[18]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[18]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[19]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[19]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[20]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[20]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[21]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[21]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[22]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[22]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[23]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[23]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[24]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[24]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[25]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[25]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[26]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[26]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[27]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[27]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[28]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[28]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[29]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[29]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[30]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[30]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[31]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[31]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[32]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[32]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[33]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[33]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[34]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[34]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[35]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[35]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[8]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[8]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[9]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[9]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[10]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[10]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[11]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[11]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[12]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[12]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[13]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[13]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[14]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[14]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[15]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[15]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[16]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[16]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[17]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[17]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[18]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[18]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[19]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[19]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[20]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[20]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[21]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[21]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[22]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[22]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[23]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[23]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[24]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[24]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[25]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[25]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[26]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[26]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[27]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[27]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[28]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[28]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[29]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[29]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[30]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[30]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[31]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[31]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[32]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[32]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[33]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[33]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[34]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[34]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[35]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[35]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {I2C_SDAT}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {I2C_SDAT}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {IRDA_RXD}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {IRDA_RXD}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {KEY[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {KEY[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {KEY[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {KEY[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {KEY[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {KEY[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {KEY[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {KEY[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[8]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[8]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[9]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[9]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[10]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[10]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[11]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[11]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[12]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[12]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[13]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[13]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[14]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[14]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[15]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[15]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DREQ0}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DREQ0}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DREQ1}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DREQ1}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_INT0}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_INT0}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_INT1}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_INT1}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {PS2_CLK}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {PS2_CLK}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {PS2_DAT}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {PS2_DAT}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SD_CMD}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SD_CMD}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SD_DAT}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SD_DAT}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SD_DAT3}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SD_DAT3}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[8]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[8]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[9]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[9]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[10]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[10]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[11]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[11]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[12]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[12]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[13]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[13]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[14]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[14]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[15]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[15]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[8]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[8]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[9]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[9]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[10]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[10]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[11]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[11]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[12]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[12]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[13]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[13]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[14]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[14]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[15]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[15]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[16]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[16]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SW[17]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SW[17]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TCK}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TCK}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TCS}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TCS}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TDI}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TDI}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_DATA[0]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_DATA[0]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_DATA[1]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_DATA[1]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_DATA[2]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_DATA[2]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_DATA[3]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_DATA[3]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_DATA[4]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_DATA[4]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_DATA[5]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_DATA[5]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_DATA[6]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_DATA[6]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_DATA[7]}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_DATA[7]}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_HS}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_HS}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_VS}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_VS}]
set_input_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {UART_RXD}]
set_input_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {UART_RXD}]


#**************************************************************
# Set Output Delay
#**************************************************************

set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {AUD_ADCLRCK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {AUD_ADCLRCK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {AUD_BCLK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {AUD_BCLK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {AUD_DACDAT}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {AUD_DACDAT}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {AUD_DACLRCK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {AUD_DACLRCK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {AUD_XCK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {AUD_XCK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_ADDR[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_ADDR[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_BA_0}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_BA_0}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_BA_1}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_BA_1}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_CAS_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_CAS_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_CKE}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_CKE}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_CLK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_CLK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_CS_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_CS_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[12]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[12]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[13]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[13]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[14]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[14]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_DQ[15]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_DQ[15]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_LDQM}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_LDQM}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_RAS_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_RAS_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_UDQM}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_UDQM}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {DRAM_WE_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {DRAM_WE_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_CLK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_CLK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_CMD}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_CMD}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_CS_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_CS_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[12]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[12]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[13]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[13]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[14]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[14]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_DATA[15]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_DATA[15]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_RD_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_RD_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_RST_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_RST_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {ENET_WR_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {ENET_WR_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[12]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[12]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[13]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[13]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[14]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[14]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[15]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[15]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[16]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[16]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[17]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[17]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[18]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[18]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[19]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[19]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[20]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[20]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_ADDR[21]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_ADDR[21]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_CE_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_CE_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_DQ[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_DQ[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_OE_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_OE_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_RST_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_RST_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {FL_WE_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {FL_WE_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[12]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[12]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[13]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[13]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[14]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[14]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[15]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[15]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[16]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[16]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[17]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[17]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[18]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[18]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[19]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[19]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[20]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[20]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[21]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[21]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[22]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[22]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[23]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[23]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[24]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[24]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[25]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[25]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[26]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[26]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[27]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[27]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[28]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[28]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[29]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[29]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[30]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[30]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[31]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[31]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[32]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[32]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[33]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[33]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[34]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[34]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_0[35]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_0[35]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[12]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[12]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[13]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[13]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[14]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[14]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[15]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[15]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[16]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[16]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[17]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[17]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[18]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[18]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[19]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[19]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[20]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[20]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[21]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[21]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[22]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[22]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[23]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[23]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[24]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[24]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[25]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[25]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[26]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[26]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[27]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[27]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[28]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[28]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[29]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[29]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[30]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[30]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[31]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[31]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[32]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[32]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[33]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[33]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[34]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[34]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {GPIO_1[35]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {GPIO_1[35]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX0[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX0[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX0[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX0[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX0[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX0[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX0[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX0[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX0[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX0[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX0[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX0[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX0[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX0[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX1[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX1[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX1[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX1[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX1[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX1[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX1[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX1[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX1[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX1[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX1[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX1[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX1[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX1[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX2[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX2[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX2[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX2[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX2[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX2[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX2[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX2[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX2[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX2[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX2[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX2[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX2[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX2[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX3[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX3[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX3[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX3[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX3[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX3[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX3[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX3[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX3[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX3[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX3[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX3[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX3[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX3[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX4[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX4[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX4[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX4[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX4[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX4[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX4[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX4[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX4[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX4[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX4[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX4[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX4[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX4[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX5[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX5[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX5[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX5[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX5[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX5[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX5[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX5[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX5[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX5[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX5[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX5[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX5[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX5[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX6[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX6[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX6[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX6[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX6[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX6[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX6[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX6[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX6[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX6[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX6[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX6[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX6[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX6[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX7[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX7[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX7[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX7[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX7[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX7[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX7[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX7[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX7[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX7[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX7[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX7[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {HEX7[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {HEX7[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {I2C_SCLK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {I2C_SCLK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {I2C_SDAT}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {I2C_SDAT}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {IRDA_TXD}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {IRDA_TXD}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_BLON}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_BLON}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_DATA[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_DATA[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_EN}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_EN}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_ON}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_ON}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_RS}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_RS}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LCD_RW}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LCD_RW}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDG[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDG[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDG[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDG[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDG[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDG[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDG[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDG[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDG[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDG[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDG[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDG[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDG[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDG[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDG[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDG[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDG[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDG[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[12]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[12]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[13]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[13]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[14]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[14]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[15]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[15]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[16]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[16]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {LEDR[17]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {LEDR[17]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_ADDR[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_ADDR[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_ADDR[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_ADDR[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_CS_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_CS_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DACK0_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DACK0_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DACK1_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DACK1_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[12]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[12]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[13]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[13]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[14]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[14]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_DATA[15]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_DATA[15]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_FSPEED}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_FSPEED}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_LSPEED}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_LSPEED}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_RD_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_RD_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_RST_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_RST_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {OTG_WR_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {OTG_WR_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SD_CLK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SD_CLK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SD_CMD}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SD_CMD}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SD_DAT}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SD_DAT}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SD_DAT3}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SD_DAT3}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[12]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[12]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[13]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[13]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[14]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[14]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[15]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[15]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[16]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[16]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_ADDR[17]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_ADDR[17]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_CE_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_CE_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[8]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[8]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[9]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[9]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[10]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[10]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[11]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[11]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[12]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[12]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[13]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[13]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[14]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[14]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_DQ[15]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_DQ[15]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_LB_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_LB_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_OE_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_OE_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_UB_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_UB_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {SRAM_WE_N}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {SRAM_WE_N}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TDO}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TDO}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {TD_RESET}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {TD_RESET}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {UART_TXD}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {UART_TXD}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_BLANK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_BLANK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_B[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_B[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_B[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_B[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_B[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_B[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_B[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_B[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_B[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_B[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_B[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_B[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_B[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_B[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_B[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_B[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_CLK}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_CLK}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_G[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_G[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_G[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_G[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_G[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_G[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_G[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_G[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_G[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_G[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_G[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_G[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_G[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_G[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_G[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_G[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_HS}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_HS}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_R[0]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_R[0]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_R[1]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_R[1]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_R[2]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_R[2]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_R[3]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_R[3]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_R[4]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_R[4]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_R[5]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_R[5]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_R[6]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_R[6]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_R[7]}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_R[7]}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_SYNC}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_SYNC}]
set_output_delay -add_delay -max -clock [get_clocks {clk}]  3.000 [get_ports {VGA_VS}]
set_output_delay -add_delay -min -clock [get_clocks {clk}]  2.000 [get_ports {VGA_VS}]


#**************************************************************
# Set Clock Groups
#**************************************************************



#**************************************************************
# Set False Path
#**************************************************************

set_false_path -from [get_keepers {*rdptr_g*}] -to [get_keepers {*ws_dgrp|dffpipe_qe9:dffpipe16|dffe17a*}]
set_false_path -from [get_keepers {*delayed_wrptr_g*}] -to [get_keepers {*rs_dgwp|dffpipe_pe9:dffpipe13|dffe14a*}]


#**************************************************************
# Set Multicycle Path
#**************************************************************



#**************************************************************
# Set Maximum Delay
#**************************************************************



#**************************************************************
# Set Minimum Delay
#**************************************************************



#**************************************************************
# Set Input Transition
#**************************************************************

